dferbas/ethernut/nut/include/arch/cm3/stm/generated/stm32f427_pinmux.h
/* Do not edit!
 * Generated from /devel/cubemx/db/mcu/IPGPIO-STM32F427_gpio_v1_0_Modes.xml*/

#if !defined(_STM32F427_PINMUX_H_)
# define _STM32F427_PINMUX_H_

#define CAN1_RX_FUNC             0
#define CAN1_TX_FUNC             1
#define CAN2_RX_FUNC             2
#define CAN2_TX_FUNC             3
#define DCMI_D0_FUNC             4
#define DCMI_D1_FUNC             5
#define DCMI_D10_FUNC            6
#define DCMI_D11_FUNC            7
#define DCMI_D12_FUNC            8
#define DCMI_D13_FUNC            9
#define DCMI_D2_FUNC             10
#define DCMI_D3_FUNC             11
#define DCMI_D4_FUNC             12
#define DCMI_D5_FUNC             13
#define DCMI_D6_FUNC             14
#define DCMI_D7_FUNC             15
#define DCMI_D8_FUNC             16
#define DCMI_D9_FUNC             17
#define DCMI_HSYNC_FUNC          18
#define DCMI_PIXCK_FUNC          19
#define DCMI_VSYNC_FUNC          20
#define ETH_COL_FUNC             21
#define ETH_CRS_FUNC             22
#define ETH_CRS_DV_FUNC          23
#define ETH_MDC_FUNC             24
#define ETH_MDIO_FUNC            25
#define ETH_PPS_OUT_FUNC         26
#define ETH_REF_CLK_FUNC         27
#define ETH_RXD0_FUNC            28
#define ETH_RXD1_FUNC            29
#define ETH_RXD2_FUNC            30
#define ETH_RXD3_FUNC            31
#define ETH_RX_CLK_FUNC          32
#define ETH_RX_DV_FUNC           33
#define ETH_RX_ER_FUNC           34
#define ETH_TXD0_FUNC            35
#define ETH_TXD1_FUNC            36
#define ETH_TXD2_FUNC            37
#define ETH_TXD3_FUNC            38
#define ETH_TX_CLK_FUNC          39
#define ETH_TX_EN_FUNC           40
#define FMC_A0_FUNC              41
#define FMC_A1_FUNC              42
#define FMC_A10_FUNC             43
#define FMC_A11_FUNC             44
#define FMC_A12_FUNC             45
#define FMC_A13_FUNC             46
#define FMC_A14_FUNC             47
#define FMC_A15_FUNC             48
#define FMC_A16_FUNC             49
#define FMC_A17_FUNC             50
#define FMC_A18_FUNC             51
#define FMC_A19_FUNC             52
#define FMC_A2_FUNC              53
#define FMC_A20_FUNC             54
#define FMC_A21_FUNC             55
#define FMC_A22_FUNC             56
#define FMC_A23_FUNC             57
#define FMC_A24_FUNC             58
#define FMC_A25_FUNC             59
#define FMC_A3_FUNC              60
#define FMC_A4_FUNC              61
#define FMC_A5_FUNC              62
#define FMC_A6_FUNC              63
#define FMC_A7_FUNC              64
#define FMC_A8_FUNC              65
#define FMC_A9_FUNC              66
#define FMC_ALE_FUNC             67
#define FMC_BA0_FUNC             68
#define FMC_BA1_FUNC             69
#define FMC_CD_FUNC              70
#define FMC_CLE_FUNC             71
#define FMC_CLK_FUNC             72
#define FMC_D0_FUNC              73
#define FMC_D1_FUNC              74
#define FMC_D10_FUNC             75
#define FMC_D11_FUNC             76
#define FMC_D12_FUNC             77
#define FMC_D13_FUNC             78
#define FMC_D14_FUNC             79
#define FMC_D15_FUNC             80
#define FMC_D16_FUNC             81
#define FMC_D17_FUNC             82
#define FMC_D18_FUNC             83
#define FMC_D19_FUNC             84
#define FMC_D2_FUNC              85
#define FMC_D20_FUNC             86
#define FMC_D21_FUNC             87
#define FMC_D22_FUNC             88
#define FMC_D23_FUNC             89
#define FMC_D24_FUNC             90
#define FMC_D25_FUNC             91
#define FMC_D26_FUNC             92
#define FMC_D27_FUNC             93
#define FMC_D28_FUNC             94
#define FMC_D29_FUNC             95
#define FMC_D3_FUNC              96
#define FMC_D30_FUNC             97
#define FMC_D31_FUNC             98
#define FMC_D4_FUNC              99
#define FMC_D5_FUNC              100
#define FMC_D6_FUNC              101
#define FMC_D7_FUNC              102
#define FMC_D8_FUNC              103
#define FMC_D9_FUNC              104
#define FMC_DA0_FUNC             105
#define FMC_DA1_FUNC             106
#define FMC_DA10_FUNC            107
#define FMC_DA11_FUNC            108
#define FMC_DA12_FUNC            109
#define FMC_DA13_FUNC            110
#define FMC_DA14_FUNC            111
#define FMC_DA15_FUNC            112
#define FMC_DA2_FUNC             113
#define FMC_DA3_FUNC             114
#define FMC_DA4_FUNC             115
#define FMC_DA5_FUNC             116
#define FMC_DA6_FUNC             117
#define FMC_DA7_FUNC             118
#define FMC_DA8_FUNC             119
#define FMC_DA9_FUNC             120
#define FMC_INT2_FUNC            121
#define FMC_INT3_FUNC            122
#define FMC_INTR_FUNC            123
#define FMC_NBL0_FUNC            124
#define FMC_NBL1_FUNC            125
#define FMC_NBL2_FUNC            126
#define FMC_NBL3_FUNC            127
#define FMC_NCE2_FUNC            128
#define FMC_NCE3_FUNC            129
#define FMC_NCE4_1_FUNC          130
#define FMC_NCE4_2_FUNC          131
#define FMC_NE1_FUNC             132
#define FMC_NE2_FUNC             133
#define FMC_NE3_FUNC             134
#define FMC_NE4_FUNC             135
#define FMC_NIORD_FUNC           136
#define FMC_NIOWR_FUNC           137
#define FMC_NL_FUNC              138
#define FMC_NOE_FUNC             139
#define FMC_NREG_FUNC            140
#define FMC_NWAIT_FUNC           141
#define FMC_NWE_FUNC             142
#define FMC_SDCKE0_FUNC          143
#define FMC_SDCKE1_FUNC          144
#define FMC_SDCLK_FUNC           145
#define FMC_SDNCAS_FUNC          146
#define FMC_SDNE0_FUNC           147
#define FMC_SDNE1_FUNC           148
#define FMC_SDNRAS_FUNC          149
#define FMC_SDNWE_FUNC           150
#define I2C1_SCL_FUNC            151
#define I2C1_SDA_FUNC            152
#define I2C1_SMBA_FUNC           153
#define I2C2_SCL_FUNC            154
#define I2C2_SDA_FUNC            155
#define I2C2_SMBA_FUNC           156
#define I2C3_SCL_FUNC            157
#define I2C3_SDA_FUNC            158
#define I2C3_SMBA_FUNC           159
#define I2S2_CK_FUNC             160
#define I2S2_MCK_FUNC            161
#define I2S2_SD_FUNC             162
#define I2S2_WS_FUNC             163
#define I2S2_ext_SD_FUNC         164
#define I2S3_CK_FUNC             165
#define I2S3_MCK_FUNC            166
#define I2S3_SD_FUNC             167
#define I2S3_WS_FUNC             168
#define I2S3_ext_SD_FUNC         169
#define I2S_CKIN_FUNC            170
#define LTDC_B0_FUNC             171
#define LTDC_B1_FUNC             172
#define LTDC_B2_FUNC             173
#define LTDC_B3_FUNC             174
#define LTDC_B4_FUNC             175
#define LTDC_B5_FUNC             176
#define LTDC_B6_FUNC             177
#define LTDC_B7_FUNC             178
#define LTDC_CLK_FUNC            179
#define LTDC_DE_FUNC             180
#define LTDC_G0_FUNC             181
#define LTDC_G1_FUNC             182
#define LTDC_G2_FUNC             183
#define LTDC_G3_FUNC             184
#define LTDC_G4_FUNC             185
#define LTDC_G5_FUNC             186
#define LTDC_G6_FUNC             187
#define LTDC_G7_FUNC             188
#define LTDC_HSYNC_FUNC          189
#define LTDC_R0_FUNC             190
#define LTDC_R1_FUNC             191
#define LTDC_R2_FUNC             192
#define LTDC_R3_FUNC             193
#define LTDC_R4_FUNC             194
#define LTDC_R5_FUNC             195
#define LTDC_R6_FUNC             196
#define LTDC_R7_FUNC             197
#define LTDC_VSYNC_FUNC          198
#define RCC_MCO_1_FUNC           199
#define RCC_MCO_2_FUNC           200
#define RTC_REFIN_FUNC           201
#define SAI1_FS_A_FUNC           202
#define SAI1_FS_B_FUNC           203
#define SAI1_MCLK_A_FUNC         204
#define SAI1_MCLK_B_FUNC         205
#define SAI1_SCK_A_FUNC          206
#define SAI1_SCK_B_FUNC          207
#define SAI1_SD_A_FUNC           208
#define SAI1_SD_B_FUNC           209
#define SDIO_CK_FUNC             210
#define SDIO_CMD_FUNC            211
#define SDIO_D0_FUNC             212
#define SDIO_D1_FUNC             213
#define SDIO_D2_FUNC             214
#define SDIO_D3_FUNC             215
#define SDIO_D4_FUNC             216
#define SDIO_D5_FUNC             217
#define SDIO_D6_FUNC             218
#define SDIO_D7_FUNC             219
#define SPI1_MISO_FUNC           220
#define SPI1_MOSI_FUNC           221
#define SPI1_NSS_FUNC            222
#define SPI1_SCK_FUNC            223
#define SPI2_MISO_FUNC           224
#define SPI2_MOSI_FUNC           225
#define SPI2_NSS_FUNC            226
#define SPI2_SCK_FUNC            227
#define SPI3_MISO_FUNC           228
#define SPI3_MOSI_FUNC           229
#define SPI3_NSS_FUNC            230
#define SPI3_SCK_FUNC            231
#define SPI4_MISO_FUNC           232
#define SPI4_MOSI_FUNC           233
#define SPI4_NSS_FUNC            234
#define SPI4_SCK_FUNC            235
#define SPI5_MISO_FUNC           236
#define SPI5_MOSI_FUNC           237
#define SPI5_NSS_FUNC            238
#define SPI5_SCK_FUNC            239
#define SPI6_MISO_FUNC           240
#define SPI6_MOSI_FUNC           241
#define SPI6_NSS_FUNC            242
#define SPI6_SCK_FUNC            243
#define SYS_JTCK_SWCLK_FUNC      244
#define SYS_JTDI_FUNC            245
#define SYS_JTDO_SWO_FUNC        246
#define SYS_JTMS_SWDIO_FUNC      247
#define SYS_JTRST_FUNC           248
#define SYS_TRACECLK_FUNC        249
#define SYS_TRACED0_FUNC         250
#define SYS_TRACED1_FUNC         251
#define SYS_TRACED2_FUNC         252
#define SYS_TRACED3_FUNC         253
#define TIM10_CH1_FUNC           254
#define TIM11_CH1_FUNC           255
#define TIM12_CH1_FUNC           256
#define TIM12_CH2_FUNC           257
#define TIM13_CH1_FUNC           258
#define TIM14_CH1_FUNC           259
#define TIM1_BKIN_FUNC           260
#define TIM1_CH1_FUNC            261
#define TIM1_CH1N_FUNC           262
#define TIM1_CH2_FUNC            263
#define TIM1_CH2N_FUNC           264
#define TIM1_CH3_FUNC            265
#define TIM1_CH3N_FUNC           266
#define TIM1_CH4_FUNC            267
#define TIM1_ETR_FUNC            268
#define TIM2_CH1_FUNC            269
#define TIM2_CH2_FUNC            270
#define TIM2_CH3_FUNC            271
#define TIM2_CH4_FUNC            272
#define TIM2_ETR_FUNC            273
#define TIM3_CH1_FUNC            274
#define TIM3_CH2_FUNC            275
#define TIM3_CH3_FUNC            276
#define TIM3_CH4_FUNC            277
#define TIM3_ETR_FUNC            278
#define TIM4_CH1_FUNC            279
#define TIM4_CH2_FUNC            280
#define TIM4_CH3_FUNC            281
#define TIM4_CH4_FUNC            282
#define TIM4_ETR_FUNC            283
#define TIM5_CH1_FUNC            284
#define TIM5_CH2_FUNC            285
#define TIM5_CH3_FUNC            286
#define TIM5_CH4_FUNC            287
#define TIM8_BKIN_FUNC           288
#define TIM8_CH1_FUNC            289
#define TIM8_CH1N_FUNC           290
#define TIM8_CH2_FUNC            291
#define TIM8_CH2N_FUNC           292
#define TIM8_CH3_FUNC            293
#define TIM8_CH3N_FUNC           294
#define TIM8_CH4_FUNC            295
#define TIM8_ETR_FUNC            296
#define TIM9_CH1_FUNC            297
#define TIM9_CH2_FUNC            298
#define UART4_RX_FUNC            299
#define UART4_TX_FUNC            300
#define UART5_RX_FUNC            301
#define UART5_TX_FUNC            302
#define UART7_RX_FUNC            303
#define UART7_TX_FUNC            304
#define UART8_RX_FUNC            305
#define UART8_TX_FUNC            306
#define USART1_CK_FUNC           307
#define UART1_CK_FUNC            307
#define USART1_CTS_FUNC          308
#define UART1_CTS_FUNC           308
#define USART1_RTS_FUNC          309
#define UART1_RTS_FUNC           309
#define USART1_RX_FUNC           310
#define UART1_RX_FUNC            310
#define USART1_TX_FUNC           311
#define UART1_TX_FUNC            311
#define USART2_CK_FUNC           312
#define UART2_CK_FUNC            312
#define USART2_CTS_FUNC          313
#define UART2_CTS_FUNC           313
#define USART2_RTS_FUNC          314
#define UART2_RTS_FUNC           314
#define USART2_RX_FUNC           315
#define UART2_RX_FUNC            315
#define USART2_TX_FUNC           316
#define UART2_TX_FUNC            316
#define USART3_CK_FUNC           317
#define UART3_CK_FUNC            317
#define USART3_CTS_FUNC          318
#define UART3_CTS_FUNC           318
#define USART3_RTS_FUNC          319
#define UART3_RTS_FUNC           319
#define USART3_RX_FUNC           320
#define UART3_RX_FUNC            320
#define USART3_TX_FUNC           321
#define UART3_TX_FUNC            321
#define USART6_CK_FUNC           322
#define UART6_CK_FUNC            322
#define USART6_CTS_FUNC          323
#define UART6_CTS_FUNC           323
#define USART6_RTS_FUNC          324
#define UART6_RTS_FUNC           324
#define USART6_RX_FUNC           325
#define UART6_RX_FUNC            325
#define USART6_TX_FUNC           326
#define UART6_TX_FUNC            326
#define USB_OTG_FS_DM_FUNC       327
#define USB_OTG_FS_DP_FUNC       328
#define USB_OTG_FS_ID_FUNC       329
#define USB_OTG_FS_SOF_FUNC      330
#define USB_OTG_HS_DM_FUNC       331
#define USB_OTG_HS_DP_FUNC       332
#define USB_OTG_HS_ID_FUNC       333
#define USB_OTG_HS_SOF_FUNC      334
#define USB_OTG_HS_ULPI_CK_FUNC  335
#define USB_OTG_HS_ULPI_D0_FUNC  336
#define USB_OTG_HS_ULPI_D1_FUNC  337
#define USB_OTG_HS_ULPI_D2_FUNC  338
#define USB_OTG_HS_ULPI_D3_FUNC  339
#define USB_OTG_HS_ULPI_D4_FUNC  340
#define USB_OTG_HS_ULPI_D5_FUNC  341
#define USB_OTG_HS_ULPI_D6_FUNC  342
#define USB_OTG_HS_ULPI_D7_FUNC  343
#define USB_OTG_HS_ULPI_DIR_FUNC 344
#define USB_OTG_HS_ULPI_NXT_FUNC 345
#define USB_OTG_HS_ULPI_STP_FUNC 346

