dferbas/ethernut/nut/include/arch/cm3/stm/generated/stm32f427_pinmux.h
# define PINMUX(gpio, func) ((gpio == PIN_NONE) ? AF_PIN_NONE : 	\
	((gpio == PA00) && (func == TIM2_CH1_FUNC            )) ?  1 : \
	((gpio == PA00) && (func == TIM2_ETR_FUNC            )) ?  1 : \
	((gpio == PA00) && (func == TIM5_CH1_FUNC            )) ?  2 : \
	((gpio == PA00) && (func == TIM8_ETR_FUNC            )) ?  3 : \
	((gpio == PA00) && (func == USART2_CTS_FUNC          )) ?  7 : \
	((gpio == PA00) && (func == UART4_TX_FUNC            )) ?  8 : \
	((gpio == PA00) && (func == ETH_CRS_FUNC             )) ? 11 : \
	((gpio == PA01) && (func == TIM2_CH2_FUNC            )) ?  1 : \
	((gpio == PA01) && (func == TIM5_CH2_FUNC            )) ?  2 : \
	((gpio == PA01) && (func == USART2_RTS_FUNC          )) ?  7 : \
	((gpio == PA01) && (func == UART4_RX_FUNC            )) ?  8 : \
	((gpio == PA01) && (func == ETH_REF_CLK_FUNC         )) ? 11 : \
	((gpio == PA01) && (func == ETH_RX_CLK_FUNC          )) ? 11 : \
	((gpio == PA02) && (func == TIM2_CH3_FUNC            )) ?  1 : \
	((gpio == PA02) && (func == TIM5_CH3_FUNC            )) ?  2 : \
	((gpio == PA02) && (func == TIM9_CH1_FUNC            )) ?  3 : \
	((gpio == PA02) && (func == USART2_TX_FUNC           )) ?  7 : \
	((gpio == PA02) && (func == ETH_MDIO_FUNC            )) ? 11 : \
	((gpio == PA03) && (func == TIM2_CH4_FUNC            )) ?  1 : \
	((gpio == PA03) && (func == TIM5_CH4_FUNC            )) ?  2 : \
	((gpio == PA03) && (func == TIM9_CH2_FUNC            )) ?  3 : \
	((gpio == PA03) && (func == USART2_RX_FUNC           )) ?  7 : \
	((gpio == PA03) && (func == USB_OTG_HS_ULPI_D0_FUNC  )) ? 10 : \
	((gpio == PA03) && (func == ETH_COL_FUNC             )) ? 11 : \
	((gpio == PA03) && (func == LTDC_B5_FUNC             )) ? 14 : \
	((gpio == PA04) && (func == SPI1_NSS_FUNC            )) ?  5 : \
	((gpio == PA04) && (func == I2S3_WS_FUNC             )) ?  6 : \
	((gpio == PA04) && (func == SPI3_NSS_FUNC            )) ?  6 : \
	((gpio == PA04) && (func == USART2_CK_FUNC           )) ?  7 : \
	((gpio == PA04) && (func == USB_OTG_HS_SOF_FUNC      )) ? 12 : \
	((gpio == PA04) && (func == DCMI_HSYNC_FUNC          )) ? 13 : \
	((gpio == PA04) && (func == LTDC_VSYNC_FUNC          )) ? 14 : \
	((gpio == PA05) && (func == TIM2_CH1_FUNC            )) ?  1 : \
	((gpio == PA05) && (func == TIM2_ETR_FUNC            )) ?  1 : \
	((gpio == PA05) && (func == TIM8_CH1N_FUNC           )) ?  3 : \
	((gpio == PA05) && (func == SPI1_SCK_FUNC            )) ?  5 : \
	((gpio == PA05) && (func == USB_OTG_HS_ULPI_CK_FUNC  )) ? 10 : \
	((gpio == PA06) && (func == TIM1_BKIN_FUNC           )) ?  1 : \
	((gpio == PA06) && (func == TIM3_CH1_FUNC            )) ?  2 : \
	((gpio == PA06) && (func == TIM8_BKIN_FUNC           )) ?  3 : \
	((gpio == PA06) && (func == SPI1_MISO_FUNC           )) ?  5 : \
	((gpio == PA06) && (func == TIM13_CH1_FUNC           )) ?  9 : \
	((gpio == PA06) && (func == DCMI_PIXCK_FUNC          )) ? 13 : \
	((gpio == PA06) && (func == LTDC_G2_FUNC             )) ? 14 : \
	((gpio == PA07) && (func == TIM1_CH1N_FUNC           )) ?  1 : \
	((gpio == PA07) && (func == TIM3_CH2_FUNC            )) ?  2 : \
	((gpio == PA07) && (func == TIM8_CH1N_FUNC           )) ?  3 : \
	((gpio == PA07) && (func == SPI1_MOSI_FUNC           )) ?  5 : \
	((gpio == PA07) && (func == TIM14_CH1_FUNC           )) ?  9 : \
	((gpio == PA07) && (func == ETH_CRS_DV_FUNC          )) ? 11 : \
	((gpio == PA07) && (func == ETH_RX_DV_FUNC           )) ? 11 : \
	((gpio == PA08) && (func == RCC_MCO_1_FUNC           )) ?  0 : \
	((gpio == PA08) && (func == TIM1_CH1_FUNC            )) ?  1 : \
	((gpio == PA08) && (func == I2C3_SCL_FUNC            )) ?  4 : \
	((gpio == PA08) && (func == USART1_CK_FUNC           )) ?  7 : \
	((gpio == PA08) && (func == USB_OTG_FS_SOF_FUNC      )) ? 10 : \
	((gpio == PA08) && (func == LTDC_R6_FUNC             )) ? 14 : \
	((gpio == PA09) && (func == TIM1_CH2_FUNC            )) ?  1 : \
	((gpio == PA09) && (func == I2C3_SMBA_FUNC           )) ?  4 : \
	((gpio == PA09) && (func == USART1_TX_FUNC           )) ?  7 : \
	((gpio == PA09) && (func == DCMI_D0_FUNC             )) ? 13 : \
	((gpio == PA10) && (func == TIM1_CH3_FUNC            )) ?  1 : \
	((gpio == PA10) && (func == USART1_RX_FUNC           )) ?  7 : \
	((gpio == PA10) && (func == USB_OTG_FS_ID_FUNC       )) ? 10 : \
	((gpio == PA10) && (func == DCMI_D1_FUNC             )) ? 13 : \
	((gpio == PA11) && (func == TIM1_CH4_FUNC            )) ?  1 : \
	((gpio == PA11) && (func == USART1_CTS_FUNC          )) ?  7 : \
	((gpio == PA11) && (func == CAN1_RX_FUNC             )) ?  9 : \
	((gpio == PA11) && (func == USB_OTG_FS_DM_FUNC       )) ? 10 : \
	((gpio == PA11) && (func == LTDC_R4_FUNC             )) ? 14 : \
	((gpio == PA12) && (func == TIM1_ETR_FUNC            )) ?  1 : \
	((gpio == PA12) && (func == USART1_RTS_FUNC          )) ?  7 : \
	((gpio == PA12) && (func == CAN1_TX_FUNC             )) ?  9 : \
	((gpio == PA12) && (func == USB_OTG_FS_DP_FUNC       )) ? 10 : \
	((gpio == PA12) && (func == LTDC_R5_FUNC             )) ? 14 : \
	((gpio == PA13) && (func == SYS_JTMS_SWDIO_FUNC      )) ?  0 : \
	((gpio == PA14) && (func == SYS_JTCK_SWCLK_FUNC      )) ?  0 : \
	((gpio == PA15) && (func == SYS_JTDI_FUNC            )) ?  0 : \
	((gpio == PA15) && (func == TIM2_CH1_FUNC            )) ?  1 : \
	((gpio == PA15) && (func == TIM2_ETR_FUNC            )) ?  1 : \
	((gpio == PA15) && (func == SPI1_NSS_FUNC            )) ?  5 : \
	((gpio == PA15) && (func == I2S3_WS_FUNC             )) ?  6 : \
	((gpio == PA15) && (func == SPI3_NSS_FUNC            )) ?  6 : \
	((gpio == PB00) && (func == TIM1_CH2N_FUNC           )) ?  1 : \
	((gpio == PB00) && (func == TIM3_CH3_FUNC            )) ?  2 : \
	((gpio == PB00) && (func == TIM8_CH2N_FUNC           )) ?  3 : \
	((gpio == PB00) && (func == LTDC_R3_FUNC             )) ?  9 : \
	((gpio == PB00) && (func == USB_OTG_HS_ULPI_D1_FUNC  )) ? 10 : \
	((gpio == PB00) && (func == ETH_RXD2_FUNC            )) ? 11 : \
	((gpio == PB01) && (func == TIM1_CH3N_FUNC           )) ?  1 : \
	((gpio == PB01) && (func == TIM3_CH4_FUNC            )) ?  2 : \
	((gpio == PB01) && (func == TIM8_CH3N_FUNC           )) ?  3 : \
	((gpio == PB01) && (func == LTDC_R6_FUNC             )) ?  9 : \
	((gpio == PB01) && (func == USB_OTG_HS_ULPI_D2_FUNC  )) ? 10 : \
	((gpio == PB01) && (func == ETH_RXD3_FUNC            )) ? 11 : \
	((gpio == PB03) && (func == SYS_JTDO_SWO_FUNC        )) ?  0 : \
	((gpio == PB03) && (func == TIM2_CH2_FUNC            )) ?  1 : \
	((gpio == PB03) && (func == SPI1_SCK_FUNC            )) ?  5 : \
	((gpio == PB03) && (func == I2S3_CK_FUNC             )) ?  6 : \
	((gpio == PB03) && (func == SPI3_SCK_FUNC            )) ?  6 : \
	((gpio == PB04) && (func == SYS_JTRST_FUNC           )) ?  0 : \
	((gpio == PB04) && (func == TIM3_CH1_FUNC            )) ?  2 : \
	((gpio == PB04) && (func == SPI1_MISO_FUNC           )) ?  5 : \
	((gpio == PB04) && (func == SPI3_MISO_FUNC           )) ?  6 : \
	((gpio == PB04) && (func == I2S3_ext_SD_FUNC         )) ?  7 : \
	((gpio == PB05) && (func == TIM3_CH2_FUNC            )) ?  2 : \
	((gpio == PB05) && (func == I2C1_SMBA_FUNC           )) ?  4 : \
	((gpio == PB05) && (func == SPI1_MOSI_FUNC           )) ?  5 : \
	((gpio == PB05) && (func == I2S3_SD_FUNC             )) ?  6 : \
	((gpio == PB05) && (func == SPI3_MOSI_FUNC           )) ?  6 : \
	((gpio == PB05) && (func == CAN2_RX_FUNC             )) ?  9 : \
	((gpio == PB05) && (func == USB_OTG_HS_ULPI_D7_FUNC  )) ? 10 : \
	((gpio == PB05) && (func == ETH_PPS_OUT_FUNC         )) ? 11 : \
	((gpio == PB05) && (func == FMC_SDCKE1_FUNC          )) ? 12 : \
	((gpio == PB05) && (func == DCMI_D10_FUNC            )) ? 13 : \
	((gpio == PB06) && (func == TIM4_CH1_FUNC            )) ?  2 : \
	((gpio == PB06) && (func == I2C1_SCL_FUNC            )) ?  4 : \
	((gpio == PB06) && (func == USART1_TX_FUNC           )) ?  7 : \
	((gpio == PB06) && (func == CAN2_TX_FUNC             )) ?  9 : \
	((gpio == PB06) && (func == FMC_SDNE1_FUNC           )) ? 12 : \
	((gpio == PB06) && (func == DCMI_D5_FUNC             )) ? 13 : \
	((gpio == PB07) && (func == TIM4_CH2_FUNC            )) ?  2 : \
	((gpio == PB07) && (func == I2C1_SDA_FUNC            )) ?  4 : \
	((gpio == PB07) && (func == USART1_RX_FUNC           )) ?  7 : \
	((gpio == PB07) && (func == FMC_NL_FUNC              )) ? 12 : \
	((gpio == PB07) && (func == DCMI_VSYNC_FUNC          )) ? 13 : \
	((gpio == PB08) && (func == TIM4_CH3_FUNC            )) ?  2 : \
	((gpio == PB08) && (func == TIM10_CH1_FUNC           )) ?  3 : \
	((gpio == PB08) && (func == I2C1_SCL_FUNC            )) ?  4 : \
	((gpio == PB08) && (func == CAN1_RX_FUNC             )) ?  9 : \
	((gpio == PB08) && (func == ETH_TXD3_FUNC            )) ? 11 : \
	((gpio == PB08) && (func == SDIO_D4_FUNC             )) ? 12 : \
	((gpio == PB08) && (func == DCMI_D6_FUNC             )) ? 13 : \
	((gpio == PB08) && (func == LTDC_B6_FUNC             )) ? 14 : \
	((gpio == PB09) && (func == TIM4_CH4_FUNC            )) ?  2 : \
	((gpio == PB09) && (func == TIM11_CH1_FUNC           )) ?  3 : \
	((gpio == PB09) && (func == I2C1_SDA_FUNC            )) ?  4 : \
	((gpio == PB09) && (func == I2S2_WS_FUNC             )) ?  5 : \
	((gpio == PB09) && (func == SPI2_NSS_FUNC            )) ?  5 : \
	((gpio == PB09) && (func == CAN1_TX_FUNC             )) ?  9 : \
	((gpio == PB09) && (func == SDIO_D5_FUNC             )) ? 12 : \
	((gpio == PB09) && (func == DCMI_D7_FUNC             )) ? 13 : \
	((gpio == PB09) && (func == LTDC_B7_FUNC             )) ? 14 : \
	((gpio == PB10) && (func == TIM2_CH3_FUNC            )) ?  1 : \
	((gpio == PB10) && (func == I2C2_SCL_FUNC            )) ?  4 : \
	((gpio == PB10) && (func == I2S2_CK_FUNC             )) ?  5 : \
	((gpio == PB10) && (func == SPI2_SCK_FUNC            )) ?  5 : \
	((gpio == PB10) && (func == USART3_TX_FUNC           )) ?  7 : \
	((gpio == PB10) && (func == USB_OTG_HS_ULPI_D3_FUNC  )) ? 10 : \
	((gpio == PB10) && (func == ETH_RX_ER_FUNC           )) ? 11 : \
	((gpio == PB10) && (func == LTDC_G4_FUNC             )) ? 14 : \
	((gpio == PB11) && (func == TIM2_CH4_FUNC            )) ?  1 : \
	((gpio == PB11) && (func == I2C2_SDA_FUNC            )) ?  4 : \
	((gpio == PB11) && (func == USART3_RX_FUNC           )) ?  7 : \
	((gpio == PB11) && (func == USB_OTG_HS_ULPI_D4_FUNC  )) ? 10 : \
	((gpio == PB11) && (func == ETH_TX_EN_FUNC           )) ? 11 : \
	((gpio == PB11) && (func == LTDC_G5_FUNC             )) ? 14 : \
	((gpio == PB12) && (func == TIM1_BKIN_FUNC           )) ?  1 : \
	((gpio == PB12) && (func == I2C2_SMBA_FUNC           )) ?  4 : \
	((gpio == PB12) && (func == I2S2_WS_FUNC             )) ?  5 : \
	((gpio == PB12) && (func == SPI2_NSS_FUNC            )) ?  5 : \
	((gpio == PB12) && (func == USART3_CK_FUNC           )) ?  7 : \
	((gpio == PB12) && (func == CAN2_RX_FUNC             )) ?  9 : \
	((gpio == PB12) && (func == USB_OTG_HS_ULPI_D5_FUNC  )) ? 10 : \
	((gpio == PB12) && (func == ETH_TXD0_FUNC            )) ? 11 : \
	((gpio == PB12) && (func == USB_OTG_HS_ID_FUNC       )) ? 12 : \
	((gpio == PB13) && (func == TIM1_CH1N_FUNC           )) ?  1 : \
	((gpio == PB13) && (func == I2S2_CK_FUNC             )) ?  5 : \
	((gpio == PB13) && (func == SPI2_SCK_FUNC            )) ?  5 : \
	((gpio == PB13) && (func == USART3_CTS_FUNC          )) ?  7 : \
	((gpio == PB13) && (func == CAN2_TX_FUNC             )) ?  9 : \
	((gpio == PB13) && (func == USB_OTG_HS_ULPI_D6_FUNC  )) ? 10 : \
	((gpio == PB13) && (func == ETH_TXD1_FUNC            )) ? 11 : \
	((gpio == PB14) && (func == TIM1_CH2N_FUNC           )) ?  1 : \
	((gpio == PB14) && (func == TIM8_CH2N_FUNC           )) ?  3 : \
	((gpio == PB14) && (func == SPI2_MISO_FUNC           )) ?  5 : \
	((gpio == PB14) && (func == I2S2_ext_SD_FUNC         )) ?  6 : \
	((gpio == PB14) && (func == USART3_RTS_FUNC          )) ?  7 : \
	((gpio == PB14) && (func == TIM12_CH1_FUNC           )) ?  9 : \
	((gpio == PB14) && (func == USB_OTG_HS_DM_FUNC       )) ? 12 : \
	((gpio == PB15) && (func == RTC_REFIN_FUNC           )) ?  0 : \
	((gpio == PB15) && (func == TIM1_CH3N_FUNC           )) ?  1 : \
	((gpio == PB15) && (func == TIM8_CH3N_FUNC           )) ?  3 : \
	((gpio == PB15) && (func == I2S2_SD_FUNC             )) ?  5 : \
	((gpio == PB15) && (func == SPI2_MOSI_FUNC           )) ?  5 : \
	((gpio == PB15) && (func == TIM12_CH2_FUNC           )) ?  9 : \
	((gpio == PB15) && (func == USB_OTG_HS_DP_FUNC       )) ? 12 : \
	((gpio == PC00) && (func == USB_OTG_HS_ULPI_STP_FUNC )) ? 10 : \
	((gpio == PC00) && (func == FMC_SDNWE_FUNC           )) ? 12 : \
	((gpio == PC01) && (func == ETH_MDC_FUNC             )) ? 11 : \
	((gpio == PC02) && (func == SPI2_MISO_FUNC           )) ?  5 : \
	((gpio == PC02) && (func == I2S2_ext_SD_FUNC         )) ?  6 : \
	((gpio == PC02) && (func == USB_OTG_HS_ULPI_DIR_FUNC )) ? 10 : \
	((gpio == PC02) && (func == ETH_TXD2_FUNC            )) ? 11 : \
	((gpio == PC02) && (func == FMC_SDNE0_FUNC           )) ? 12 : \
	((gpio == PC03) && (func == I2S2_SD_FUNC             )) ?  5 : \
	((gpio == PC03) && (func == SPI2_MOSI_FUNC           )) ?  5 : \
	((gpio == PC03) && (func == USB_OTG_HS_ULPI_NXT_FUNC )) ? 10 : \
	((gpio == PC03) && (func == ETH_TX_CLK_FUNC          )) ? 11 : \
	((gpio == PC03) && (func == FMC_SDCKE0_FUNC          )) ? 12 : \
	((gpio == PC04) && (func == ETH_RXD0_FUNC            )) ? 11 : \
	((gpio == PC05) && (func == ETH_RXD1_FUNC            )) ? 11 : \
	((gpio == PC06) && (func == TIM3_CH1_FUNC            )) ?  2 : \
	((gpio == PC06) && (func == TIM8_CH1_FUNC            )) ?  3 : \
	((gpio == PC06) && (func == I2S2_MCK_FUNC            )) ?  5 : \
	((gpio == PC06) && (func == USART6_TX_FUNC           )) ?  8 : \
	((gpio == PC06) && (func == SDIO_D6_FUNC             )) ? 12 : \
	((gpio == PC06) && (func == DCMI_D0_FUNC             )) ? 13 : \
	((gpio == PC06) && (func == LTDC_HSYNC_FUNC          )) ? 14 : \
	((gpio == PC07) && (func == TIM3_CH2_FUNC            )) ?  2 : \
	((gpio == PC07) && (func == TIM8_CH2_FUNC            )) ?  3 : \
	((gpio == PC07) && (func == I2S3_MCK_FUNC            )) ?  6 : \
	((gpio == PC07) && (func == USART6_RX_FUNC           )) ?  8 : \
	((gpio == PC07) && (func == SDIO_D7_FUNC             )) ? 12 : \
	((gpio == PC07) && (func == DCMI_D1_FUNC             )) ? 13 : \
	((gpio == PC07) && (func == LTDC_G6_FUNC             )) ? 14 : \
	((gpio == PC08) && (func == TIM3_CH3_FUNC            )) ?  2 : \
	((gpio == PC08) && (func == TIM8_CH3_FUNC            )) ?  3 : \
	((gpio == PC08) && (func == USART6_CK_FUNC           )) ?  8 : \
	((gpio == PC08) && (func == SDIO_D0_FUNC             )) ? 12 : \
	((gpio == PC08) && (func == DCMI_D2_FUNC             )) ? 13 : \
	((gpio == PC09) && (func == RCC_MCO_2_FUNC           )) ?  0 : \
	((gpio == PC09) && (func == TIM3_CH4_FUNC            )) ?  2 : \
	((gpio == PC09) && (func == TIM8_CH4_FUNC            )) ?  3 : \
	((gpio == PC09) && (func == I2C3_SDA_FUNC            )) ?  4 : \
	((gpio == PC09) && (func == I2S_CKIN_FUNC            )) ?  5 : \
	((gpio == PC09) && (func == SDIO_D1_FUNC             )) ? 12 : \
	((gpio == PC09) && (func == DCMI_D3_FUNC             )) ? 13 : \
	((gpio == PC10) && (func == I2S3_CK_FUNC             )) ?  6 : \
	((gpio == PC10) && (func == SPI3_SCK_FUNC            )) ?  6 : \
	((gpio == PC10) && (func == USART3_TX_FUNC           )) ?  7 : \
	((gpio == PC10) && (func == UART4_TX_FUNC            )) ?  8 : \
	((gpio == PC10) && (func == SDIO_D2_FUNC             )) ? 12 : \
	((gpio == PC10) && (func == DCMI_D8_FUNC             )) ? 13 : \
	((gpio == PC10) && (func == LTDC_R2_FUNC             )) ? 14 : \
	((gpio == PC11) && (func == I2S3_ext_SD_FUNC         )) ?  5 : \
	((gpio == PC11) && (func == SPI3_MISO_FUNC           )) ?  6 : \
	((gpio == PC11) && (func == USART3_RX_FUNC           )) ?  7 : \
	((gpio == PC11) && (func == UART4_RX_FUNC            )) ?  8 : \
	((gpio == PC11) && (func == SDIO_D3_FUNC             )) ? 12 : \
	((gpio == PC11) && (func == DCMI_D4_FUNC             )) ? 13 : \
	((gpio == PC12) && (func == I2S3_SD_FUNC             )) ?  6 : \
	((gpio == PC12) && (func == SPI3_MOSI_FUNC           )) ?  6 : \
	((gpio == PC12) && (func == USART3_CK_FUNC           )) ?  7 : \
	((gpio == PC12) && (func == UART5_TX_FUNC            )) ?  8 : \
	((gpio == PC12) && (func == SDIO_CK_FUNC             )) ? 12 : \
	((gpio == PC12) && (func == DCMI_D9_FUNC             )) ? 13 : \
	((gpio == PD00) && (func == CAN1_RX_FUNC             )) ?  9 : \
	((gpio == PD00) && (func == FMC_D2_FUNC              )) ? 12 : \
	((gpio == PD00) && (func == FMC_DA2_FUNC             )) ? 12 : \
	((gpio == PD01) && (func == CAN1_TX_FUNC             )) ?  9 : \
	((gpio == PD01) && (func == FMC_D3_FUNC              )) ? 12 : \
	((gpio == PD01) && (func == FMC_DA3_FUNC             )) ? 12 : \
	((gpio == PD02) && (func == TIM3_ETR_FUNC            )) ?  2 : \
	((gpio == PD02) && (func == UART5_RX_FUNC            )) ?  8 : \
	((gpio == PD02) && (func == SDIO_CMD_FUNC            )) ? 12 : \
	((gpio == PD02) && (func == DCMI_D11_FUNC            )) ? 13 : \
	((gpio == PD03) && (func == I2S2_CK_FUNC             )) ?  5 : \
	((gpio == PD03) && (func == SPI2_SCK_FUNC            )) ?  5 : \
	((gpio == PD03) && (func == USART2_CTS_FUNC          )) ?  7 : \
	((gpio == PD03) && (func == FMC_CLK_FUNC             )) ? 12 : \
	((gpio == PD03) && (func == DCMI_D5_FUNC             )) ? 13 : \
	((gpio == PD03) && (func == LTDC_G7_FUNC             )) ? 14 : \
	((gpio == PD04) && (func == USART2_RTS_FUNC          )) ?  7 : \
	((gpio == PD04) && (func == FMC_NOE_FUNC             )) ? 12 : \
	((gpio == PD05) && (func == USART2_TX_FUNC           )) ?  7 : \
	((gpio == PD05) && (func == FMC_NWE_FUNC             )) ? 12 : \
	((gpio == PD06) && (func == I2S3_SD_FUNC             )) ?  5 : \
	((gpio == PD06) && (func == SPI3_MOSI_FUNC           )) ?  5 : \
	((gpio == PD06) && (func == SAI1_SD_A_FUNC           )) ?  6 : \
	((gpio == PD06) && (func == USART2_RX_FUNC           )) ?  7 : \
	((gpio == PD06) && (func == FMC_NWAIT_FUNC           )) ? 12 : \
	((gpio == PD06) && (func == DCMI_D10_FUNC            )) ? 13 : \
	((gpio == PD06) && (func == LTDC_B2_FUNC             )) ? 14 : \
	((gpio == PD07) && (func == USART2_CK_FUNC           )) ?  7 : \
	((gpio == PD07) && (func == FMC_NCE2_FUNC            )) ? 12 : \
	((gpio == PD07) && (func == FMC_NE1_FUNC             )) ? 12 : \
	((gpio == PD08) && (func == USART3_TX_FUNC           )) ?  7 : \
	((gpio == PD08) && (func == FMC_D13_FUNC             )) ? 12 : \
	((gpio == PD08) && (func == FMC_DA13_FUNC            )) ? 12 : \
	((gpio == PD09) && (func == USART3_RX_FUNC           )) ?  7 : \
	((gpio == PD09) && (func == FMC_D14_FUNC             )) ? 12 : \
	((gpio == PD09) && (func == FMC_DA14_FUNC            )) ? 12 : \
	((gpio == PD10) && (func == USART3_CK_FUNC           )) ?  7 : \
	((gpio == PD10) && (func == FMC_D15_FUNC             )) ? 12 : \
	((gpio == PD10) && (func == FMC_DA15_FUNC            )) ? 12 : \
	((gpio == PD10) && (func == LTDC_B3_FUNC             )) ? 14 : \
	((gpio == PD11) && (func == USART3_CTS_FUNC          )) ?  7 : \
	((gpio == PD11) && (func == FMC_A16_FUNC             )) ? 12 : \
	((gpio == PD11) && (func == FMC_CLE_FUNC             )) ? 12 : \
	((gpio == PD12) && (func == TIM4_CH1_FUNC            )) ?  2 : \
	((gpio == PD12) && (func == USART3_RTS_FUNC          )) ?  7 : \
	((gpio == PD12) && (func == FMC_A17_FUNC             )) ? 12 : \
	((gpio == PD12) && (func == FMC_ALE_FUNC             )) ? 12 : \
	((gpio == PD13) && (func == TIM4_CH2_FUNC            )) ?  2 : \
	((gpio == PD13) && (func == FMC_A18_FUNC             )) ? 12 : \
	((gpio == PD14) && (func == TIM4_CH3_FUNC            )) ?  2 : \
	((gpio == PD14) && (func == FMC_D0_FUNC              )) ? 12 : \
	((gpio == PD14) && (func == FMC_DA0_FUNC             )) ? 12 : \
	((gpio == PD15) && (func == TIM4_CH4_FUNC            )) ?  2 : \
	((gpio == PD15) && (func == FMC_D1_FUNC              )) ? 12 : \
	((gpio == PD15) && (func == FMC_DA1_FUNC             )) ? 12 : \
	((gpio == PE00) && (func == TIM4_ETR_FUNC            )) ?  2 : \
	((gpio == PE00) && (func == UART8_RX_FUNC            )) ?  8 : \
	((gpio == PE00) && (func == FMC_NBL0_FUNC            )) ? 12 : \
	((gpio == PE00) && (func == DCMI_D2_FUNC             )) ? 13 : \
	((gpio == PE01) && (func == UART8_TX_FUNC            )) ?  8 : \
	((gpio == PE01) && (func == FMC_NBL1_FUNC            )) ? 12 : \
	((gpio == PE01) && (func == DCMI_D3_FUNC             )) ? 13 : \
	((gpio == PE02) && (func == SYS_TRACECLK_FUNC        )) ?  0 : \
	((gpio == PE02) && (func == SPI4_SCK_FUNC            )) ?  5 : \
	((gpio == PE02) && (func == SAI1_MCLK_A_FUNC         )) ?  6 : \
	((gpio == PE02) && (func == ETH_TXD3_FUNC            )) ? 11 : \
	((gpio == PE02) && (func == FMC_A23_FUNC             )) ? 12 : \
	((gpio == PE03) && (func == SYS_TRACED0_FUNC         )) ?  0 : \
	((gpio == PE03) && (func == SAI1_SD_B_FUNC           )) ?  6 : \
	((gpio == PE03) && (func == FMC_A19_FUNC             )) ? 12 : \
	((gpio == PE04) && (func == SYS_TRACED1_FUNC         )) ?  0 : \
	((gpio == PE04) && (func == SPI4_NSS_FUNC            )) ?  5 : \
	((gpio == PE04) && (func == SAI1_FS_A_FUNC           )) ?  6 : \
	((gpio == PE04) && (func == FMC_A20_FUNC             )) ? 12 : \
	((gpio == PE04) && (func == DCMI_D4_FUNC             )) ? 13 : \
	((gpio == PE04) && (func == LTDC_B0_FUNC             )) ? 14 : \
	((gpio == PE05) && (func == SYS_TRACED2_FUNC         )) ?  0 : \
	((gpio == PE05) && (func == TIM9_CH1_FUNC            )) ?  3 : \
	((gpio == PE05) && (func == SPI4_MISO_FUNC           )) ?  5 : \
	((gpio == PE05) && (func == SAI1_SCK_A_FUNC          )) ?  6 : \
	((gpio == PE05) && (func == FMC_A21_FUNC             )) ? 12 : \
	((gpio == PE05) && (func == DCMI_D6_FUNC             )) ? 13 : \
	((gpio == PE05) && (func == LTDC_G0_FUNC             )) ? 14 : \
	((gpio == PE06) && (func == SYS_TRACED3_FUNC         )) ?  0 : \
	((gpio == PE06) && (func == TIM9_CH2_FUNC            )) ?  3 : \
	((gpio == PE06) && (func == SPI4_MOSI_FUNC           )) ?  5 : \
	((gpio == PE06) && (func == SAI1_SD_A_FUNC           )) ?  6 : \
	((gpio == PE06) && (func == FMC_A22_FUNC             )) ? 12 : \
	((gpio == PE06) && (func == DCMI_D7_FUNC             )) ? 13 : \
	((gpio == PE06) && (func == LTDC_G1_FUNC             )) ? 14 : \
	((gpio == PE07) && (func == TIM1_ETR_FUNC            )) ?  1 : \
	((gpio == PE07) && (func == UART7_RX_FUNC            )) ?  8 : \
	((gpio == PE07) && (func == FMC_D4_FUNC              )) ? 12 : \
	((gpio == PE07) && (func == FMC_DA4_FUNC             )) ? 12 : \
	((gpio == PE08) && (func == TIM1_CH1N_FUNC           )) ?  1 : \
	((gpio == PE08) && (func == UART7_TX_FUNC            )) ?  8 : \
	((gpio == PE08) && (func == FMC_D5_FUNC              )) ? 12 : \
	((gpio == PE08) && (func == FMC_DA5_FUNC             )) ? 12 : \
	((gpio == PE09) && (func == TIM1_CH1_FUNC            )) ?  1 : \
	((gpio == PE09) && (func == FMC_D6_FUNC              )) ? 12 : \
	((gpio == PE09) && (func == FMC_DA6_FUNC             )) ? 12 : \
	((gpio == PE10) && (func == TIM1_CH2N_FUNC           )) ?  1 : \
	((gpio == PE10) && (func == FMC_D7_FUNC              )) ? 12 : \
	((gpio == PE10) && (func == FMC_DA7_FUNC             )) ? 12 : \
	((gpio == PE11) && (func == TIM1_CH2_FUNC            )) ?  1 : \
	((gpio == PE11) && (func == SPI4_NSS_FUNC            )) ?  5 : \
	((gpio == PE11) && (func == FMC_D8_FUNC              )) ? 12 : \
	((gpio == PE11) && (func == FMC_DA8_FUNC             )) ? 12 : \
	((gpio == PE11) && (func == LTDC_G3_FUNC             )) ? 14 : \
	((gpio == PE12) && (func == TIM1_CH3N_FUNC           )) ?  1 : \
	((gpio == PE12) && (func == SPI4_SCK_FUNC            )) ?  5 : \
	((gpio == PE12) && (func == FMC_D9_FUNC              )) ? 12 : \
	((gpio == PE12) && (func == FMC_DA9_FUNC             )) ? 12 : \
	((gpio == PE12) && (func == LTDC_B4_FUNC             )) ? 14 : \
	((gpio == PE13) && (func == TIM1_CH3_FUNC            )) ?  1 : \
