dferbas/ethernut/nut/include/arch/cm3/stm/generated/stm32f427_pinmux.h
	((gpio == PE13) && (func == SPI4_MISO_FUNC           )) ?  5 : \
	((gpio == PE13) && (func == FMC_D10_FUNC             )) ? 12 : \
	((gpio == PE13) && (func == FMC_DA10_FUNC            )) ? 12 : \
	((gpio == PE13) && (func == LTDC_DE_FUNC             )) ? 14 : \
	((gpio == PE14) && (func == TIM1_CH4_FUNC            )) ?  1 : \
	((gpio == PE14) && (func == SPI4_MOSI_FUNC           )) ?  5 : \
	((gpio == PE14) && (func == FMC_D11_FUNC             )) ? 12 : \
	((gpio == PE14) && (func == FMC_DA11_FUNC            )) ? 12 : \
	((gpio == PE14) && (func == LTDC_CLK_FUNC            )) ? 14 : \
	((gpio == PE15) && (func == TIM1_BKIN_FUNC           )) ?  1 : \
	((gpio == PE15) && (func == FMC_D12_FUNC             )) ? 12 : \
	((gpio == PE15) && (func == FMC_DA12_FUNC            )) ? 12 : \
	((gpio == PE15) && (func == LTDC_R7_FUNC             )) ? 14 : \
	((gpio == PF00) && (func == I2C2_SDA_FUNC            )) ?  4 : \
	((gpio == PF00) && (func == FMC_A0_FUNC              )) ? 12 : \
	((gpio == PF01) && (func == I2C2_SCL_FUNC            )) ?  4 : \
	((gpio == PF01) && (func == FMC_A1_FUNC              )) ? 12 : \
	((gpio == PF02) && (func == I2C2_SMBA_FUNC           )) ?  4 : \
	((gpio == PF02) && (func == FMC_A2_FUNC              )) ? 12 : \
	((gpio == PF03) && (func == FMC_A3_FUNC              )) ? 12 : \
	((gpio == PF04) && (func == FMC_A4_FUNC              )) ? 12 : \
	((gpio == PF05) && (func == FMC_A5_FUNC              )) ? 12 : \
	((gpio == PF06) && (func == TIM10_CH1_FUNC           )) ?  3 : \
	((gpio == PF06) && (func == SPI5_NSS_FUNC            )) ?  5 : \
	((gpio == PF06) && (func == SAI1_SD_B_FUNC           )) ?  6 : \
	((gpio == PF06) && (func == UART7_RX_FUNC            )) ?  8 : \
	((gpio == PF06) && (func == FMC_NIORD_FUNC           )) ? 12 : \
	((gpio == PF07) && (func == TIM11_CH1_FUNC           )) ?  3 : \
	((gpio == PF07) && (func == SPI5_SCK_FUNC            )) ?  5 : \
	((gpio == PF07) && (func == SAI1_MCLK_B_FUNC         )) ?  6 : \
	((gpio == PF07) && (func == UART7_TX_FUNC            )) ?  8 : \
	((gpio == PF07) && (func == FMC_NREG_FUNC            )) ? 12 : \
	((gpio == PF08) && (func == SPI5_MISO_FUNC           )) ?  5 : \
	((gpio == PF08) && (func == SAI1_SCK_B_FUNC          )) ?  6 : \
	((gpio == PF08) && (func == TIM13_CH1_FUNC           )) ?  9 : \
	((gpio == PF08) && (func == FMC_NIOWR_FUNC           )) ? 12 : \
	((gpio == PF09) && (func == SPI5_MOSI_FUNC           )) ?  5 : \
	((gpio == PF09) && (func == SAI1_FS_B_FUNC           )) ?  6 : \
	((gpio == PF09) && (func == TIM14_CH1_FUNC           )) ?  9 : \
	((gpio == PF09) && (func == FMC_CD_FUNC              )) ? 12 : \
	((gpio == PF10) && (func == FMC_INTR_FUNC            )) ? 12 : \
	((gpio == PF10) && (func == DCMI_D11_FUNC            )) ? 13 : \
	((gpio == PF10) && (func == LTDC_DE_FUNC             )) ? 14 : \
	((gpio == PF11) && (func == SPI5_MOSI_FUNC           )) ?  5 : \
	((gpio == PF11) && (func == FMC_SDNRAS_FUNC          )) ? 12 : \
	((gpio == PF11) && (func == DCMI_D12_FUNC            )) ? 13 : \
	((gpio == PF12) && (func == FMC_A6_FUNC              )) ? 12 : \
	((gpio == PF13) && (func == FMC_A7_FUNC              )) ? 12 : \
	((gpio == PF14) && (func == FMC_A8_FUNC              )) ? 12 : \
	((gpio == PF15) && (func == FMC_A9_FUNC              )) ? 12 : \
	((gpio == PG00) && (func == FMC_A10_FUNC             )) ? 12 : \
	((gpio == PG01) && (func == FMC_A11_FUNC             )) ? 12 : \
	((gpio == PG02) && (func == FMC_A12_FUNC             )) ? 12 : \
	((gpio == PG03) && (func == FMC_A13_FUNC             )) ? 12 : \
	((gpio == PG04) && (func == FMC_A14_FUNC             )) ? 12 : \
	((gpio == PG04) && (func == FMC_BA0_FUNC             )) ? 12 : \
	((gpio == PG05) && (func == FMC_A15_FUNC             )) ? 12 : \
	((gpio == PG05) && (func == FMC_BA1_FUNC             )) ? 12 : \
	((gpio == PG06) && (func == FMC_INT2_FUNC            )) ? 12 : \
	((gpio == PG06) && (func == DCMI_D12_FUNC            )) ? 13 : \
	((gpio == PG06) && (func == LTDC_R7_FUNC             )) ? 14 : \
	((gpio == PG07) && (func == USART6_CK_FUNC           )) ?  8 : \
	((gpio == PG07) && (func == FMC_INT3_FUNC            )) ? 12 : \
	((gpio == PG07) && (func == DCMI_D13_FUNC            )) ? 13 : \
	((gpio == PG07) && (func == LTDC_CLK_FUNC            )) ? 14 : \
	((gpio == PG08) && (func == SPI6_NSS_FUNC            )) ?  5 : \
	((gpio == PG08) && (func == USART6_RTS_FUNC          )) ?  8 : \
	((gpio == PG08) && (func == ETH_PPS_OUT_FUNC         )) ? 11 : \
	((gpio == PG08) && (func == FMC_SDCLK_FUNC           )) ? 12 : \
	((gpio == PG09) && (func == USART6_RX_FUNC           )) ?  8 : \
	((gpio == PG09) && (func == FMC_NCE3_FUNC            )) ? 12 : \
	((gpio == PG09) && (func == FMC_NE2_FUNC             )) ? 12 : \
	((gpio == PG09) && (func == DCMI_VSYNC_FUNC          )) ? 13 : \
	((gpio == PG10) && (func == LTDC_G3_FUNC             )) ?  9 : \
	((gpio == PG10) && (func == FMC_NCE4_1_FUNC          )) ? 12 : \
	((gpio == PG10) && (func == FMC_NE3_FUNC             )) ? 12 : \
	((gpio == PG10) && (func == DCMI_D2_FUNC             )) ? 13 : \
	((gpio == PG10) && (func == LTDC_B2_FUNC             )) ? 14 : \
	((gpio == PG11) && (func == ETH_TX_EN_FUNC           )) ? 11 : \
	((gpio == PG11) && (func == FMC_NCE4_2_FUNC          )) ? 12 : \
	((gpio == PG11) && (func == DCMI_D3_FUNC             )) ? 13 : \
	((gpio == PG11) && (func == LTDC_B3_FUNC             )) ? 14 : \
	((gpio == PG12) && (func == SPI6_MISO_FUNC           )) ?  5 : \
	((gpio == PG12) && (func == USART6_RTS_FUNC          )) ?  8 : \
	((gpio == PG12) && (func == LTDC_B4_FUNC             )) ?  9 : \
	((gpio == PG12) && (func == FMC_NE4_FUNC             )) ? 12 : \
	((gpio == PG12) && (func == LTDC_B1_FUNC             )) ? 14 : \
	((gpio == PG13) && (func == SPI6_SCK_FUNC            )) ?  5 : \
	((gpio == PG13) && (func == USART6_CTS_FUNC          )) ?  8 : \
	((gpio == PG13) && (func == ETH_TXD0_FUNC            )) ? 11 : \
	((gpio == PG13) && (func == FMC_A24_FUNC             )) ? 12 : \
	((gpio == PG14) && (func == SPI6_MOSI_FUNC           )) ?  5 : \
	((gpio == PG14) && (func == USART6_TX_FUNC           )) ?  8 : \
	((gpio == PG14) && (func == ETH_TXD1_FUNC            )) ? 11 : \
	((gpio == PG14) && (func == FMC_A25_FUNC             )) ? 12 : \
	((gpio == PG15) && (func == USART6_CTS_FUNC          )) ?  8 : \
	((gpio == PG15) && (func == FMC_SDNCAS_FUNC          )) ? 12 : \
	((gpio == PG15) && (func == DCMI_D13_FUNC            )) ? 13 : \
	((gpio == PH02) && (func == ETH_CRS_FUNC             )) ? 11 : \
	((gpio == PH02) && (func == FMC_SDCKE0_FUNC          )) ? 12 : \
	((gpio == PH02) && (func == LTDC_R0_FUNC             )) ? 14 : \
	((gpio == PH03) && (func == ETH_COL_FUNC             )) ? 11 : \
	((gpio == PH03) && (func == FMC_SDNE0_FUNC           )) ? 12 : \
	((gpio == PH03) && (func == LTDC_R1_FUNC             )) ? 14 : \
	((gpio == PH04) && (func == I2C2_SCL_FUNC            )) ?  4 : \
	((gpio == PH04) && (func == USB_OTG_HS_ULPI_NXT_FUNC )) ? 10 : \
	((gpio == PH05) && (func == I2C2_SDA_FUNC            )) ?  4 : \
	((gpio == PH05) && (func == SPI5_NSS_FUNC            )) ?  5 : \
	((gpio == PH05) && (func == FMC_SDNWE_FUNC           )) ? 12 : \
	((gpio == PH06) && (func == I2C2_SMBA_FUNC           )) ?  4 : \
	((gpio == PH06) && (func == SPI5_SCK_FUNC            )) ?  5 : \
	((gpio == PH06) && (func == TIM12_CH1_FUNC           )) ?  9 : \
	((gpio == PH06) && (func == ETH_RXD2_FUNC            )) ? 11 : \
	((gpio == PH06) && (func == FMC_SDNE1_FUNC           )) ? 12 : \
	((gpio == PH06) && (func == DCMI_D8_FUNC             )) ? 13 : \
	((gpio == PH07) && (func == I2C3_SCL_FUNC            )) ?  4 : \
	((gpio == PH07) && (func == SPI5_MISO_FUNC           )) ?  5 : \
	((gpio == PH07) && (func == ETH_RXD3_FUNC            )) ? 11 : \
	((gpio == PH07) && (func == FMC_SDCKE1_FUNC          )) ? 12 : \
	((gpio == PH07) && (func == DCMI_D9_FUNC             )) ? 13 : \
	((gpio == PH08) && (func == I2C3_SDA_FUNC            )) ?  4 : \
	((gpio == PH08) && (func == FMC_D16_FUNC             )) ? 12 : \
	((gpio == PH08) && (func == DCMI_HSYNC_FUNC          )) ? 13 : \
	((gpio == PH08) && (func == LTDC_R2_FUNC             )) ? 14 : \
	((gpio == PH09) && (func == I2C3_SMBA_FUNC           )) ?  4 : \
	((gpio == PH09) && (func == TIM12_CH2_FUNC           )) ?  9 : \
	((gpio == PH09) && (func == FMC_D17_FUNC             )) ? 12 : \
	((gpio == PH09) && (func == DCMI_D0_FUNC             )) ? 13 : \
	((gpio == PH09) && (func == LTDC_R3_FUNC             )) ? 14 : \
	((gpio == PH10) && (func == TIM5_CH1_FUNC            )) ?  2 : \
	((gpio == PH10) && (func == FMC_D18_FUNC             )) ? 12 : \
	((gpio == PH10) && (func == DCMI_D1_FUNC             )) ? 13 : \
	((gpio == PH10) && (func == LTDC_R4_FUNC             )) ? 14 : \
	((gpio == PH11) && (func == TIM5_CH2_FUNC            )) ?  2 : \
	((gpio == PH11) && (func == FMC_D19_FUNC             )) ? 12 : \
	((gpio == PH11) && (func == DCMI_D2_FUNC             )) ? 13 : \
	((gpio == PH11) && (func == LTDC_R5_FUNC             )) ? 14 : \
	((gpio == PH12) && (func == TIM5_CH3_FUNC            )) ?  2 : \
	((gpio == PH12) && (func == FMC_D20_FUNC             )) ? 12 : \
	((gpio == PH12) && (func == DCMI_D3_FUNC             )) ? 13 : \
	((gpio == PH12) && (func == LTDC_R6_FUNC             )) ? 14 : \
	((gpio == PH13) && (func == TIM8_CH1N_FUNC           )) ?  3 : \
	((gpio == PH13) && (func == CAN1_TX_FUNC             )) ?  9 : \
	((gpio == PH13) && (func == FMC_D21_FUNC             )) ? 12 : \
	((gpio == PH13) && (func == LTDC_G2_FUNC             )) ? 14 : \
	((gpio == PH14) && (func == TIM8_CH2N_FUNC           )) ?  3 : \
	((gpio == PH14) && (func == FMC_D22_FUNC             )) ? 12 : \
	((gpio == PH14) && (func == DCMI_D4_FUNC             )) ? 13 : \
	((gpio == PH14) && (func == LTDC_G3_FUNC             )) ? 14 : \
	((gpio == PH15) && (func == TIM8_CH3N_FUNC           )) ?  3 : \
	((gpio == PH15) && (func == FMC_D23_FUNC             )) ? 12 : \
	((gpio == PH15) && (func == DCMI_D11_FUNC            )) ? 13 : \
	((gpio == PH15) && (func == LTDC_G4_FUNC             )) ? 14 : \
	((gpio == PI00) && (func == TIM5_CH4_FUNC            )) ?  2 : \
	((gpio == PI00) && (func == I2S2_WS_FUNC             )) ?  5 : \
	((gpio == PI00) && (func == SPI2_NSS_FUNC            )) ?  5 : \
	((gpio == PI00) && (func == FMC_D24_FUNC             )) ? 12 : \
	((gpio == PI00) && (func == DCMI_D13_FUNC            )) ? 13 : \
	((gpio == PI00) && (func == LTDC_G5_FUNC             )) ? 14 : \
	((gpio == PI01) && (func == I2S2_CK_FUNC             )) ?  5 : \
	((gpio == PI01) && (func == SPI2_SCK_FUNC            )) ?  5 : \
	((gpio == PI01) && (func == FMC_D25_FUNC             )) ? 12 : \
	((gpio == PI01) && (func == DCMI_D8_FUNC             )) ? 13 : \
	((gpio == PI01) && (func == LTDC_G6_FUNC             )) ? 14 : \
	((gpio == PI02) && (func == TIM8_CH4_FUNC            )) ?  3 : \
	((gpio == PI02) && (func == SPI2_MISO_FUNC           )) ?  5 : \
	((gpio == PI02) && (func == I2S2_ext_SD_FUNC         )) ?  6 : \
	((gpio == PI02) && (func == FMC_D26_FUNC             )) ? 12 : \
	((gpio == PI02) && (func == DCMI_D9_FUNC             )) ? 13 : \
	((gpio == PI02) && (func == LTDC_G7_FUNC             )) ? 14 : \
	((gpio == PI03) && (func == TIM8_ETR_FUNC            )) ?  3 : \
	((gpio == PI03) && (func == I2S2_SD_FUNC             )) ?  5 : \
	((gpio == PI03) && (func == SPI2_MOSI_FUNC           )) ?  5 : \
	((gpio == PI03) && (func == FMC_D27_FUNC             )) ? 12 : \
	((gpio == PI03) && (func == DCMI_D10_FUNC            )) ? 13 : \
	((gpio == PI04) && (func == TIM8_BKIN_FUNC           )) ?  3 : \
	((gpio == PI04) && (func == FMC_NBL2_FUNC            )) ? 12 : \
	((gpio == PI04) && (func == DCMI_D5_FUNC             )) ? 13 : \
	((gpio == PI04) && (func == LTDC_B4_FUNC             )) ? 14 : \
	((gpio == PI05) && (func == TIM8_CH1_FUNC            )) ?  3 : \
	((gpio == PI05) && (func == FMC_NBL3_FUNC            )) ? 12 : \
	((gpio == PI05) && (func == DCMI_VSYNC_FUNC          )) ? 13 : \
	((gpio == PI05) && (func == LTDC_B5_FUNC             )) ? 14 : \
	((gpio == PI06) && (func == TIM8_CH2_FUNC            )) ?  3 : \
	((gpio == PI06) && (func == FMC_D28_FUNC             )) ? 12 : \
	((gpio == PI06) && (func == DCMI_D6_FUNC             )) ? 13 : \
	((gpio == PI06) && (func == LTDC_B6_FUNC             )) ? 14 : \
	((gpio == PI07) && (func == TIM8_CH3_FUNC            )) ?  3 : \
	((gpio == PI07) && (func == FMC_D29_FUNC             )) ? 12 : \
	((gpio == PI07) && (func == DCMI_D7_FUNC             )) ? 13 : \
	((gpio == PI07) && (func == LTDC_B7_FUNC             )) ? 14 : \
	((gpio == PI09) && (func == CAN1_RX_FUNC             )) ?  9 : \
	((gpio == PI09) && (func == FMC_D30_FUNC             )) ? 12 : \
	((gpio == PI09) && (func == LTDC_VSYNC_FUNC          )) ? 14 : \
	((gpio == PI10) && (func == ETH_RX_ER_FUNC           )) ? 11 : \
	((gpio == PI10) && (func == FMC_D31_FUNC             )) ? 12 : \
	((gpio == PI10) && (func == LTDC_HSYNC_FUNC          )) ? 14 : \
	((gpio == PI11) && (func == USB_OTG_HS_ULPI_DIR_FUNC )) ? 10 : \
	((gpio == PI12) && (func == LTDC_HSYNC_FUNC          )) ? 14 : \
	((gpio == PI13) && (func == LTDC_VSYNC_FUNC          )) ? 14 : \
	((gpio == PI14) && (func == LTDC_CLK_FUNC            )) ? 14 : \
	((gpio == PI15) && (func == LTDC_R0_FUNC             )) ? 14 : \
	((gpio == PJ00) && (func == LTDC_R1_FUNC             )) ? 14 : \
	((gpio == PJ01) && (func == LTDC_R2_FUNC             )) ? 14 : \
	((gpio == PJ02) && (func == LTDC_R3_FUNC             )) ? 14 : \
	((gpio == PJ03) && (func == LTDC_R4_FUNC             )) ? 14 : \
	((gpio == PJ04) && (func == LTDC_R5_FUNC             )) ? 14 : \
	((gpio == PJ05) && (func == LTDC_R6_FUNC             )) ? 14 : \
	((gpio == PJ06) && (func == LTDC_R7_FUNC             )) ? 14 : \
	((gpio == PJ07) && (func == LTDC_G0_FUNC             )) ? 14 : \
	((gpio == PJ08) && (func == LTDC_G1_FUNC             )) ? 14 : \
	((gpio == PJ09) && (func == LTDC_G2_FUNC             )) ? 14 : \
	((gpio == PJ10) && (func == LTDC_G3_FUNC             )) ? 14 : \
	((gpio == PJ11) && (func == LTDC_G4_FUNC             )) ? 14 : \
	((gpio == PJ12) && (func == LTDC_B0_FUNC             )) ? 14 : \
	((gpio == PJ13) && (func == LTDC_B1_FUNC             )) ? 14 : \
	((gpio == PJ14) && (func == LTDC_B2_FUNC             )) ? 14 : \
	((gpio == PJ15) && (func == LTDC_B3_FUNC             )) ? 14 : \
	((gpio == PK00) && (func == LTDC_G5_FUNC             )) ? 14 : \
	((gpio == PK01) && (func == LTDC_G6_FUNC             )) ? 14 : \
	((gpio == PK02) && (func == LTDC_G7_FUNC             )) ? 14 : \
	((gpio == PK03) && (func == LTDC_B4_FUNC             )) ? 14 : \
	((gpio == PK04) && (func == LTDC_B5_FUNC             )) ? 14 : \
	((gpio == PK05) && (func == LTDC_B6_FUNC             )) ? 14 : \
	((gpio == PK06) && (func == LTDC_B7_FUNC             )) ? 14 : \
	((gpio == PK07) && (func == LTDC_DE_FUNC             )) ? 14 : \
	AF_NO_SUCH_PINFUNC)

